EnvisionIEGet3rdPartyData/ConsoleTestService/Schema DataSet.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <Set_Demographic xmlns="http://www.miracleadvance.com/">
      <data>
        <xsd:schema id="EnvisionIE" xmlns="" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata">
          <xs:element name="EnvisionIE" msdata:IsDataSet="true" msdata:UseCurrentLocale="true">
            <xs:complexType>
              <xs:choice minOccurs="0" maxOccurs="unbounded">
                <xs:element name="ACK">
                  <xs:complexType>
                    <xs:sequence>
                      <xs:element name="ACKNOWLEDGMENT_CODE" type="xs:string" minOccurs="0" />
                      <xs:element name="MESSAGE_CONTROL_ID" type="xs:string" minOccurs="0" />
                      <xs:element name="TEXT_MESSAGE" type="xs:string" minOccurs="0" />
                    </xs:sequence>
                  </xs:complexType>
                </xs:element>
              </xs:choice>
            </xs:complexType>
          </xs:element>
        </xsd:schema>
        <diffgr:diffgram xmlns:msdata="urn:schemas-microsoft-com:xml-msdata" xmlns:diffgr="urn:schemas-microsoft-com:xml-diffgram-v1">
          <EnvisionIE xmlns="">
            <ACK diffgr:id="ACK1" msdata:rowOrder="0">
              <ACKNOWLEDGMENT_CODE />
              <TEXT_MESSAGE>Coming soon!</TEXT_MESSAGE>
            </ACK>
          </EnvisionIE>
        </diffgr:diffgram>
      </data>
    </Set_Demographic>
  </soap12:Body>
</soap12:Envelope>